//: Playground - noun: a place where people can play

import UIKit

//基础操作符

//加减乘除,数学操作符
10 / 2
10 / 2.0
//10 / 0





//swift可以对浮点数求余数(%) 特殊

5 + 2  //二元
-10    //一元(紧跟)
var x = 5
-x
x += 1   //一元
x += 1   //一元

//赋值操作符
// a = b,用b的值来初始化或更新a的值

//元祖型变量一次可以给多个变量赋值

var (a, b , c) = (3, 4, 5)
a
b
c

//加法操作符,还可以用来拼接字符窜
"中国" + "人"

//求余%,支持整数和浮点数
15 % 4
//15 % 3.5
//9.5 % 5
//+6  不能再数字字面量前面加"+"号
//组合操作符   +=  -=  *=  /=

//可选空合操作符:用于对可选类型判断和拆包的快捷操作. 形式: 可选变量?? 强拆失败返回值

var 午饭: String?
let 吃什么 = 午饭 ?? "没东西吃,好可怜" //没值直接赋值返回
吃什么






